[
    {
        "category": "Backend",
        "skills": [
            {
                "label": "cpp",
                "title": "C++: Programming Language",
                "subtitle": "High Performance and Interoperability",
                "description": "I use C++ to develop high-performance libraries and APIs, focusing on projects where efficiency and low-level control are essential, such as high-volume data processing and system optimization."
            },
            {
                "label": "python",
                "title": "Python: Programming Language",
                "subtitle": "Data Science and Machine Learning",
                "description": "I use Python to build data pipelines, perform data analysis, develop machine learning models, and automate workflows in data-driven environments."
            },
            {
                "label": "tensorflow",
                "title": "TensorFlow: Deep Learning Framework",
                "subtitle": "Neural Network Modeling",
                "description": "I use TensorFlow to design and train deep learning models in Python, applied to tasks such as time series forecasting, synthetic data generation, and AI experimentation with sequential and generative architectures."
            },
            {
                "label": "nodejs",
                "title": "NodeJS: Backend Runtime Environment",
                "subtitle": "Server-Side Development",
                "description": "I use NodeJS to build fast and scalable backend services, enabling the development of RESTful APIs, real-time applications with WebSockets, and efficient database integrations."
            }
        ]
    },
    {
        "category": "Frontend",
        "skills": [
            {
                "label": "javascript",
                "title": "Javascript: Programming Language",
                "subtitle": "Dynamic Behavior and Frontend Logic",
                "description": "I use JavaScript to add interactivity and dynamic behavior to web applications through event handling and data rendering. It complements HTML and CSS in building responsive, data-driven user interfaces."
            },
            {
                "label": "typescript",
                "title": "TypeScript: Typed JavaScript Superset",
                "subtitle": "Strong Typing and Code Reliability",
                "description": "I use TypeScript to enhance JavaScript with static typing and advanced tooling. It improves reliability, maintainability, and scalability by reducing runtime errors and supporting large-scale projects."
            },
            {
                "label": "react",
                "title": "React: UI 'Framework'",
                "subtitle": "Web user interface",
                "description": "I use React to build dynamic and reusable user interfaces through component-based architecture. It simplifies state management, optimizes rendering performance, and enables the development of scalable single-page applications (SPA)."
            },
            {
                "label": "tailwind",
                "title": "Tailwind: Utility-first CSS framework",
                "subtitle": "Fast development of modern websites",
                "description": "I use Tailwind to style web applications with utility-first classes, accelerating development while ensuring responsive and modern design. It allows building consistent layouts directly within the HTML structure."
            }
        ]
    },
    {
        "category": "Devops",
        "skills": [
            {
                "label": "bash",
                "title": "Bash: Build Automation Tool",
                "subtitle": "Automates Compilation and Workflow Tasks",
                "description": "I use Bash in the Linux terminal to automate tasks, manage workflows, and write scripts for compilation, testing, and system administration. It is an essential tool for efficient development and daily operations in Linux environments."
            },
            {
                "label": "git",
                "title": "Git: Version Control System",
                "subtitle": "Code Management and Collaboration",
                "description": "I use Git to track changes, manage branches, and collaborate on code efficiently. Most of my projects are versioned and maintained with Git, often integrated with GitHub for remote hosting and CI/CD pipelines."
            },
            {
                "label": "docker",
                "title": "Docker: Containerization Platform",
                "subtitle": "Environment Automation and Portability",
                "description": "I use Docker to containerize applications and ensure consistent environments across development and production. With Docker Compose, I orchestrate multi-container setups for projects involving databases, APIs, and data processing pipelines."
            }
        ]
    },
    {
        "category": "Storage",
        "skills": [
            {
                "label": "mysql",
                "title": "MySQL: Relational Database",
                "subtitle": "Ideal for Web and Lightweight Applications",
                "description": "I use MySQL to design and manage relational data models, especially in projects with frontend integration. It’s effective for creating normalized schemas with tools like MySQL Workbench and is well-suited for small to medium-scale applications."
            },
            {
                "label": "postgres",
                "title": "PostgreSQL: Relational Database",
                "subtitle": "Enterprise-Grade Data Management",
                "description": "PostgreSQL is my preferred choice for scalable and robust data management solutions. I use it in production environments, often with Docker-based setups, due to its reliability, advanced features, and strong SQL compliance."
            },
            {
                "label": "influxdb",
                "title": "InfluxDB: Time Series Database",
                "subtitle": "Real-Time Data Monitoring",
                "description": "I use InfluxDB to store and query time series data efficiently, especially for system and application monitoring. It’s a NoSQL engine optimized for time-stamped data and integrates seamlessly with tools like Grafana."
            }
        ]
    },
    {
        "category": "Tools",
        "skills": [
            {
                "label": "grafana",
                "title": "Grafana: Data Visualization Platform",
                "subtitle": "Observability and AI Monitoring",
                "description": "I use Grafana to build interactive dashboards that visualize time series data, system metrics, and AI results. It plays a key role in MLOps pipelines by tracking model performance and monitoring infrastructure in real time."
            }
        ]
    }
]
